documents/images/graphio/stdlib/contrast_vector3.dot
digraph {
  rankdir = LR;
    NG_contrast_vector3_N_add_vector3 [label= "add"];
    NG_contrast_vector3_N_add_vector3[shape = box];
    NG_contrast_vector3_N_add_vector3 ->     NG_contrast_vector3_out;
    NG_contrast_vector3_out [label= "out"];
    NG_contrast_vector3_out[shape = box]; 
    NG_contrast_vector3_pivotINT [label="pivot"];
    NG_contrast_vector3_pivotINT [shape = ellipse];
    NG_contrast_vector3_N_add_vector3 [label="add"];
    NG_contrast_vector3_pivotINT -> NG_contrast_vector3_N_add_vector3 [label=".in2"];
    NG_contrast_vector3_N_mul_vector3 [label= "multiply"];
    NG_contrast_vector3_N_mul_vector3[shape = box];
    NG_contrast_vector3_N_mul_vector3 ->     NG_contrast_vector3_N_add_vector3 [label= "in1"];
    NG_contrast_vector3_N_add_vector3 [label= "add"];
    NG_contrast_vector3_N_add_vector3[shape = box]; 
    NG_contrast_vector3_amountINT [label="amount"];
    NG_contrast_vector3_amountINT [shape = ellipse];
    NG_contrast_vector3_N_mul_vector3 [label="multiply"];
    NG_contrast_vector3_amountINT -> NG_contrast_vector3_N_mul_vector3 [label=".in2"];
    NG_contrast_vector3_N_sub_vector3 [label= "subtract"];
    NG_contrast_vector3_N_sub_vector3[shape = box];
    NG_contrast_vector3_N_sub_vector3 ->     NG_contrast_vector3_N_mul_vector3 [label= "in1"];
    NG_contrast_vector3_N_mul_vector3 [label= "multiply"];
    NG_contrast_vector3_N_mul_vector3[shape = box]; 
    NG_contrast_vector3_inINT [label="in"];
    NG_contrast_vector3_inINT [shape = ellipse];
    NG_contrast_vector3_N_sub_vector3 [label="subtract"];
    NG_contrast_vector3_inINT -> NG_contrast_vector3_N_sub_vector3 [label=".in1"];
    NG_contrast_vector3_pivotINT [label="pivot"];
    NG_contrast_vector3_pivotINT [shape = ellipse];
    NG_contrast_vector3_N_sub_vector3 [label="subtract"];
    NG_contrast_vector3_pivotINT -> NG_contrast_vector3_N_sub_vector3 [label=".in2"];
}
